{"jsonProps":"{\"zoom\":0.8}","title":"Brandon Plastic Surgery","isLockedBy":null,"creatorFullName":"Marvin Shienbaum","role":"none","description":null,"createdBy":"brandonplasticsurgeryfl@gmail.com","creationTime":"2024-10-03T12:38:30Z","lastModificationBy":"Marvin Shienbaum","lastModificationTime":"2024-10-03T12:39:48Z","xml":"<map name=\"1793432\" theme=\"prism\" version=\"tango\"><topic central=\"true\" text=\"Brandon Plastic Surgery\" id=\"1\"><topic position=\"290,0\" order=\"0\" id=\"2\"><text><![CDATA[500 Vonderburg Dr Suite 110W Brandon FL 33511\n\nUnited States\n\n(813) 681-5709\n\nhttps://www.brandonplasticsurgery.com/\n\noffice@brandonplasticsurgery.com]]></text></topic><topic position=\"-393,0\" order=\"1\" id=\"3\"><text><![CDATA[For anybody thinking about cosmetic plastic surgery, obtaining specialist and\nunbiased advice from a knowledgeable and reputable plastic surgeon is an\nessential first step. Dr. Shienbaum supplies you over 30 years of ingenious and\ncomprehensive plastic surgery expertise. He holds the distinction of being\nchosen by experts at Castle Connolly as a Top Plastic Surgeon for ten\nconsecutive years and is amongst the very best in his specialty. The Best\nPhysicians section of US News & World Report has actually recognized Dr.\nShienbaum as a Top Plastic Surgeon. He appeared in the Outstanding Plastic\nSurgeons of Florida section of Cosmopolitan Magazine and has actually been\ndesignated as one of America's Top PlasticSurgeons by the Consumers Research\nCouncil of America. The Tampa Tribune- Brandon News readers poll voted Dr.\nShienbaum Best Plastic Surgeon of Brandon while the Tampa Tribune-- Courier\nreaders poll voted him Best Cosmetic Surgeon in Plant City. He has actually\nbeen cited as a Premier Tampa Plastic Surgeon in Good Housekeeping Magazine and\nnoted in Women's Day Magazine to have actually been one of the most very\nregarded and accomplished plastic surgeons in the Tampa Bay area. Redbook\nMagazine healthcare profiles him as a Premier Tampa Plastic Surgeon. Dr.\nShienbaum is featured in the Tampa Bay Magazine April/March Issue as a Top\nPlastic Surgeon in the Tampa Bay area. He was voted Best in Our Region and was\nchosen from the publisher in what they have heard from others and whom they\nknow and trust. Physicians that are chosen are highly regarded by their peers.]]></text></topic></topic></map>","public":true}