{"jsonProps":"{\"zoom\":0.8}","title":"West End Therapy","isLockedBy":null,"creatorFullName":"Christine  Holowick","role":"none","description":null,"createdBy":"westendtherapy@hyperdrivemail.com","creationTime":"2025-09-17T01:46:11Z","lastModificationBy":"Christine  Holowick","lastModificationTime":"2025-09-17T01:49:07Z","xml":"<map name=\"1951869\" theme=\"prism\" version=\"tango\"><topic central=\"true\" text=\"West End Therapy\" id=\"1\"><topic position=\"2453,-45\" order=\"0\" id=\"2\"><text><![CDATA[• Address: 759 Wall St Winnipeg MB R3G 2T6 Canada\n• Phone: (204) 809-9114\n• Website: https://www.westendtherapy.ca/\n• Email: inquiries@westendtherapy.ca\n\nWest End Therapy is a group psychotherapy and relational therapy practice committed to providing exceptional quality therapy services to people living in Manitoba since 2020. Our mission is to provide a place where people want to come to improve their well-being and where therapists want to practice and are valued for the important work they do. We strive to honour your path and process of healing, and it’s important to us that you feel welcomed and understood. All of our therapists are specially trained in their particular area of expertise and are experienced in working with diverse people and communities. We want your therapy experience to be positive and valuable, and we view therapy as a collaborative experience where your feedback is welcomed.\nOur team of dedicated therapists are all registered with a professional body in Manitoba. As a group practice, our therapists have the opportunity to share expertise and collaborate through group supervision and peer support. Personally, our team holds in high regard values of social responsibility, kindness and compassion, and many of us live in the community that we work in.\nWe’re proud to offer services out of six beautiful therapy rooms, centrally located in one of Winnipeg’s most vibrant communities. Sound proofing and sound masking ensure your privacy, and we only use indirect non-florescent lighting. Both of our office spaces are one flight of stairs from ground-level and are unfortunately not wheelchair accessible.\nWe also serve people living in rural Manitoba communities, as we offer both individual and relational therapy remotely via online video sessions. Additionally, our Social Workers are registered with First Nations & Inuit Health Branch, making our services accessible to Indigenous people and families.\n]]></text></topic></topic></map>","public":true}