{"jsonProps":"{\"zoom\":0.8}","title":"Boxergy Glasgow","isLockedBy":null,"creatorFullName":"Jim  Laidlaw","role":"none","description":null,"createdBy":"boxergyglasgow@gmail.com","creationTime":"2025-02-10T18:42:13Z","lastModificationBy":"Jim  Laidlaw","lastModificationTime":"2025-02-12T01:41:45Z","xml":"<map name=\"1859417\" theme=\"dark-prism\" version=\"tango\"><topic central=\"true\" text=\"Boxergy Glasgow\" id=\"1\"><topic position=\"369,-256\" order=\"0\" id=\"2\"><text><![CDATA[272 Bath Street Glasgow G2 4JR UK\n0141 343 9430\nhttps://boxergy.co.uk/heat-pump-installation-glasgow/\nboxers@boxergy.co.uk\n\nAir Source Heat Pump Installer in Glasgow-- Hero2 Heat Pump System #hero \n2heatpump #hero 2heatpumpsystem.\n\nWe are award winning, relied on air source heat pump installers based in Glasgow, \nbeing experts in the innovative Hero2 Heat Pump System. Our patented system is \ndesigned to supply a compact, energy-efficient heating solution for homes where \ntypical air source heat pumps might not be feasible. If you're looking for a space-\nsaving and cost-effective choice to traditional heating systems, we are right here to \ndeliver the excellent solution.\n\nThe Hero2 Heat Pump System supplies an innovative strategy to home heating. Its \ncompact design maximises your living space by freeing up valuable indoor \nlocations, making it ideal for homes with limited room for large equipment. This \nsystem streamlines the installation process, which can be completed in simply \nsomeday, minimising disruption and reducing expenses. It's not simply efficient; it's \ndesigned for hassle-free integration into your home.\n\nPriced at just ₤ 4,000 *, the Hero2 Heat Pump System is comparable to the \nsubstitute expense of a conventional gas boiler, making it an affordable alternative \nfor homeowners seeking to update to a modern-day, eco-friendly heating solution. \nUnlike standard systems, the Hero2 Heat Pump System is engineered to fit where \nothers can't, supplying powerful heating performance in a compact, space-saving \nunit.\n\nOur commitment to high quality and worth is reinforced by our Best Price \nGuarantee. If you discover a competitor's quote, we will certainly match it *, \nguaranteeing you get the best deal on your new heat pump system. Whether \nyou're replacing an old gas boiler or installing a heat pump for the first time, the \nHero2 Heat Pump System delivers unbeatable effectiveness, practicality, and \naffordability.\n\nAs specialist heat pump installers in Glasgow, we are proud to offer a solution that \ncombines innovative style, reliable performance, and exceptional value for money. \nThe Hero2 Heat Pump System is an optimal option for anyone searching for \nenergy-efficient heating solutions that maximise room while minimising hassle and \ncost. Call us today to learn more about the Hero2 Heat Pump System and take the \nfirst step towards transforming your home's heating system.\n\n* T&C s Apply.\n\n\n\n]]></text></topic></topic></map>","public":true}