{"jsonProps":"{\"zoom\":0.8}","title":"Straith Clinic","isLockedBy":null,"creatorFullName":"William Sabbagh","role":"none","description":null,"createdBy":"straithclinic@outlook.com","creationTime":"2024-10-09T13:19:04Z","lastModificationBy":"William Sabbagh","lastModificationTime":"2024-10-09T13:19:42Z","xml":"<map name=\"1797343\" theme=\"prism\" version=\"tango\"><topic central=\"true\" text=\"Straith Clinic\" id=\"1\"><topic position=\"-557,0\" order=\"1\" id=\"2\"><text><![CDATA[The Straith Clinic is one of America's leading plastic surgery centers. We've been serving women and men in the Metropolitan Detroit area for 70\nyears. Our reputation is built on an extremely high standard of patient care in plastic surgery. When you visit Straith Clinic for plastic\nsurgery in Bingham Farms, you can expect experienced, skilled and thoughtful care from Dr. Sabbagh and our staff. The Straith Clinic employs\nover twenty assistance staff, a lot of them with more than ten years of employment at our Metropolitan Detroit cosmetic surgery center. Our nurse\nanesthetists have worked with us for more than twenty years, and specialize in office-based anesthesia for plastic surgical procedures. They have\nactually offered over 15,000 IV sedation anesthetics for office-- based surgeries, therefore, you experience a high level of comfort and\nsafety. Our operating room is staffed with registered nurses and our entire staff is devoted to offering top quality care. We train our medical and\noffice staff to anticipate your requirements. \"The Clinic runs effectively because everyone understands his/her role. That permits\na smoother, a lot more enjoyable patient experience\" claims Dr. William Sabbagh. You will certainly see your plastic surgeon twice prior to your\nsurgery and for your post-operate visits. Before picking us, we invite you to investigate our plastic surgeon, facility, fees and the\noutcomes of our cosmetic surgery procedures for yourself. Just arrange a free confidential visit to our facility and consult with our plastic\nsurgeon. Straith Clinic obtained special recognition for risk management practices. The Straith Clinic's history and tradition\ncontinues today as part of that added measure of confidence you want in your health care services. It's another way for us to claim that \"We care about\nyou.]]></text></topic><topic position=\"298,0\" order=\"0\" id=\"3\"><text><![CDATA[• 248-647-5800\n• surgery@straithclinic.com\n• https://straithclinic.com\n• 32000 Telegraph Road, Bingham Farms, MI 48025, United States]]></text></topic></topic></map>","public":true}