{
  "jsonProps": "{\"zoom\":0.8}",
  "title": "Shaddix Plastic Surgery",
  "isLockedBy": null,
  "creatorFullName": "Kyle  Shaddix",
  "role": "none",
  "description": null,
  "createdBy": "shaddixplasticsurgery@outlook.com",
  "creationTime": "2025-07-04T07:22:59Z",
  "lastModificationBy": "Kyle  Shaddix",
  "lastModificationTime": "2025-07-04T07:24:01Z",
  "xml": "<map name=\"1924468\" theme=\"prism\" version=\"tango\"><topic central=\"true\" text=\"Shaddix Plastic Surgery\" id=\"1\"><topic position=\"256,-102\" order=\"0\" id=\"2\"><text><![CDATA[5147 N 9th Ave #203\nPensacola\nFL\n32504\nUnited States\n\n850-476-7100\n\nhttps://www.shaddixplasticsurgery.com\n\ndrshaddix@shaddixplasticsurgery.com]]></text></topic><topic position=\"494,80\" order=\"2\" id=\"3\"><text><![CDATA[At Shaddix Plastic Surgery, our entire team wants to assist you reach your aesthetic goals. \nWhile you have lots of options of plastic surgeons in Pensacola, we hope you will certainly provide us \nthe opportunity to reveal you how we are different. We recognize that each person has one-of-a-kind \nconcerns concerning their appearance. We take the time to understand these concerns in order to craft \na personalized treatment strategy. We always keep a pressure-free environment and recognize that the \ndecision to pursue cosmetic surgery is significant. At your consultation, our objective is to educate you \nabout the options available so that you can understand each of them and make the decision that suits \nyou finest. Likewise, this website has been designed with you in mind. The site offers us an additional method \nto supply info that will certainly allow you to make even more informed selections. We genuinely hope that you \nwill discover extra about our practice, the many cosmetic improvement procedures and treatments available to you, \nand various other useful info that will certainly answer questions you may have about plastic surgery. Dr. Shaddix is \nboard licensed in plastic surgery and has spent years training to be able to provide beautiful and natural results in a \nsafe and affordable fashion. He would love the opportunity to meet you. If you are considering a facelift, liposuction, \nbreast augmentation, or merely Botox or another non-surgical treatment in Pensacola and along Florida's Gulf Coast, \nplease give us a call. We look forward to hearing from you.\n]]></text></topic></topic></map>",
  "public": true
}