{"jsonProps":"{\"zoom\":0.8}","title":"Cosmetic Surgery Associates","isLockedBy":null,"creatorFullName":"Franklin  Richards, M.D.","role":"none","description":null,"createdBy":"cosmeticplastics.md@gmail.com","creationTime":"2025-01-09T16:14:42Z","lastModificationBy":"Franklin  Richards, M.D.","lastModificationTime":"2025-01-16T18:11:25Z","xml":"<map name=\"1840978\" theme=\"prism\" version=\"tango\"><topic central=\"true\" text=\"Cosmetic Surgery Associates\" id=\"1\"><topic position=\"379,0\" order=\"0\" id=\"2\"><text><![CDATA[Our method, located in Bethesda, Maryland provides the most recent in\n cosmetic surgery procedures in a safe, caring environment. Dr.\n Richards, Dr. Jabs, and Dr. Magge are board certified, completely\n trained plastic surgeons focusing on the art and science of cosmetic\n surgery. They have the prestigious certification of Advanced\n Qualification in Cosmetic Surgery and have performed countless\n successful operations on patients similar to you. They are members of\n the American Society of Plastic Surgeons and the American Society for\n Aesthetic Plastic Surgery and have actually served as President of The\n National Capital Society of Plastic Surgeons.\n\nFrom the moment you enter the office, throughout your consultation and\n later in all of your dealings with our staff you will certainly be\n treated courteously with attention lavished on making your desires for\n an improved appearance come true. An attentive personnel that pamper\n you and treat you as family set our technique apart. We invite you to\n browse our Photo Gallery to see prior to and after photos of the\n procedures we perform. We look forward to seeing you and invite you to\n schedule a consultation to read more about how we can help you achieve\n your goals.\n]]></text></topic><topic position=\"-352,0\" order=\"1\" id=\"3\"><text><![CDATA[6430 Rockledge Dr Suite #100 Bethesda MD 20817 United States\n\n301-493-4334\n\nhttps://cosmeticplastics.com/\n\ninfo@cosmeticplastics.com\n\n]]></text></topic></topic></map>","public":true}