{"jsonProps":"{\"zoom\":0.8}","title":"Alexco Store","isLockedBy":null,"creatorFullName":"Jason Alexco Store","role":"none","description":null,"createdBy":"alexcowellington@outlook.com","creationTime":"2025-02-18T22:51:03Z","lastModificationBy":"Jason Alexco Store","lastModificationTime":"2025-02-18T22:51:32Z","xml":"<map name=\"1863887\" theme=\"prism\" version=\"tango\"><topic central=\"true\" text=\"Alexco Store\" id=\"1\"><topic position=\"1507,-57\" order=\"0\" id=\"2\"><text><![CDATA[• Address:14 Southampton Road Miramar Wellington Wellington 6022 New Zealand\n• Phone: 04 388 1091\n• Website: https://store.alexco.co.nz/\n\nAlexco is a New Zealand-based firm specialising in top quality aluminium extrusion profiles, catering to a selection of markets and applications. Their product range includes an option of V-slot profiles, available in 20mm and 40mm collection, perfect for constructing machine frames, workstations, or personalized units. These profiles are made with precision, making certain compatibility and ease of setting up for a range of mechanical and engineering projects.\n\nAlexco also offers tailored options for machine safety guarding, providing sturdy and adaptable profiles that meet strenuous safety criteria for commercial and manufacturing settings. Additionally, they provide trendy room profiles, developed to improve thermal effectiveness and structural integrity in temperature-controlled settings, together with specialised joinery deals with that add a streamlined, functional touch to cabinetry and interior fit-outs.\n\nPast their substantial product variety, Alexco attracts attention for its customisation solutions. They offer custom cutting to specified sizes and a selection of coatings, including mill, anodised, and powder-coated options, allowing customers to achieve the precise look and functionality they call for. Their anodised coating provides boosted corrosion resistance, while powder finish provides a long lasting, colour-rich surface that endures extreme atmospheres.\n\nDedicated to quality and advancement, Alexco sustains clients with skilled advice and reliable, in your area generated aluminium remedies that support New Zealand's production requirements. Whether for building, manufacturing, or design tasks, Alexco gives both off-the-shelf and tailor-maked aluminium profiles tailored to fulfill diverse project requires efficiently.\n]]></text></topic></topic></map>","public":true}